package cn.max.pixiv.common;

/**
 * @author MaxStar
 * @date 2020/5/10
 */
public class MenuConstant {

    // 主菜单
    public static final String MAIN_TITLE =
            "************************************************\n" +
                    "*   PIXIV下载助手\n" +
                    "************************************************\n" +
                    "*   请输入以下数字+回车执行对应功能\n" +
                    "*   1.搜索原图及图片下载\n" +
                    "*   2.设置图片下载路径或代理\n" +
                    "*   0.退出\n" +
                    "************************************************\n";

    // pixiv
    public static final String PIXIV_TITLE =
            "\n" +
                    "*   下载菜单\n" +
                    "************************************************\n" +
                    "*   请输入以下数字+参数执行对应功能\n" +
                    "*   如 1 C:/demo.jpg\n" +
                    "*   1.搜索本地图片的原图并下载（请输入绝对路径）\n" +
                    "*   2.通过图片ID下载图片\n" +
                    "*   0.返回主菜单\n";

    // pixiv
    public static final String SETTING_TITLE =
            "\n" +
                    "*   设置菜单\n" +
                    "************************************************\n" +
                    "*   请输入以下数字+参数执行对应功能\n" +
                    "*   如 1 127.0.0.1 8888 \n" +
                    "*   1.设置代理IP及端口 \n" +
                    "*   2.设置下载路径 \n" +
                    "*   0.返回主菜单 \n";
}
